{
  "resourceType": "ConceptMap",
  "id": "R5-DeviceNameType-R4-DeviceNameType",
  "url": "http://hl7.org/fhir/uv/xver/R5-R4/ConceptMap/R5-DeviceNameType-R4-DeviceNameType",
  "name": "R5-DeviceNameType-R4-DeviceNameType",
  "title": "Concept map to convert a FHIR R5 DeviceNameType into FHIR R4",
  "sourceScopeCanonical": "http://hl7.org/fhir/ValueSet/device-nametype|5.0.0",
  "targetScopeCanonical": "http://hl7.org/fhir/ValueSet/device-nametype|4.0.1",
  "group": [
    {
      "source": "http://hl7.org/fhir/device-nametype",
      "target": "http://hl7.org/fhir/device-nametype",
      "element": [
        {
          "code": "patient-reported-name",
          "display": "the term used by the patient associated with the device when describing the device, for example \u0027knee implant\u0027, when documented as a self-reported device.",
          "target": [
            {
              "code": "patient-reported-name",
              "display": "Patient Reported name.",
              "relationship": "equivalent",
              "comment": "R5 \u0060patient-reported-name\u0060 is equivalent to R4 \u0060patient-reported-name\u0060."
            }
          ]
        },
        {
          "code": "registered-name",
          "display": "The term assigned to a medical device by the entity who registers or submits information about it to a jurisdiction or its databases. This may be considered the manufacturer assigned name (e.g., brand name assigned by the labeler or manufacturer in US, or device name assigned by the manufacturer in EU) and may also be synonymous with proprietary name or trade name of the device.",
          "target": [
            {
              "code": "manufacturer-name",
              "display": "Manufacturer name.",
              "relationship": "equivalent",
              "comment": "R5 \u0060registered-name\u0060 is equivalent to R4 \u0060manufacturer-name\u0060."
            }
          ]
        },
        {
          "code": "user-friendly-name",
          "display": "The term that generically describes the device by a name as assigned by the manufacturer that is recognized by lay person.  This common or generic name may be printed on the package it came in or some combination of that name with the model number, serial number, or other attribute that makes the name easy to understand for the user of that device. It is often exposed in communicating devices transport protocols. It is provided to help users identify the device when reported in discovery operations.",
          "target": [
            {
              "code": "user-friendly-name",
              "display": "User Friendly name.",
              "relationship": "equivalent",
              "comment": "R5 \u0060user-friendly-name\u0060 is equivalent to R4 \u0060user-friendly-name\u0060."
            }
          ]
        }
      ]
    }
  ]
}