{
  "resourceType": "ConceptMap",
  "id": "R5-RequestResourceTypes-R4-RequestResourceType",
  "url": "http://hl7.org/fhir/uv/xver/R5-R4/ConceptMap/R5-RequestResourceTypes-R4-RequestResourceType",
  "name": "R5-RequestResourceTypes-R4-RequestResourceType",
  "title": "Concept map to convert a FHIR R5 RequestResourceTypes into FHIR R4",
  "sourceScopeCanonical": "http://hl7.org/fhir/ValueSet/request-resource-types|5.0.0",
  "targetScopeCanonical": "http://hl7.org/fhir/ValueSet/request-resource-types|4.0.1",
  "group": [
    {
      "source": "http://hl7.org/fhir/fhir-types",
      "target": "http://hl7.org/fhir/request-resource-types",
      "element": [
        {
          "code": "Appointment",
          "display": "A booking of a healthcare event among patient(s), practitioner(s), related person(s) and/or device(s) for a specific date/time. This may result in one or more Encounter(s).",
          "target": [
            {
              "code": "Appointment",
              "display": "A booking of a healthcare event among patient(s), practitioner(s), related person(s) and/or device(s) for a specific date/time. This may result in one or more Encounter(s).",
              "relationship": "equivalent",
              "comment": "R5 \u0060Appointment\u0060 is assumed equivalent to R4 \u0060Appointment\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "AppointmentResponse",
          "display": "A reply to an appointment request for a patient and/or practitioner(s), such as a confirmation or rejection.",
          "target": [
            {
              "code": "AppointmentResponse",
              "display": "A reply to an appointment request for a patient and/or practitioner(s), such as a confirmation or rejection.",
              "relationship": "equivalent",
              "comment": "R5 \u0060AppointmentResponse\u0060 is assumed equivalent to R4 \u0060AppointmentResponse\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "CarePlan",
          "display": "Describes the intention of how one or more practitioners intend to deliver care for a particular patient, group or community for a period of time, possibly limited to care for a specific condition or set of conditions.",
          "target": [
            {
              "code": "CarePlan",
              "display": "Healthcare plan for patient or group.",
              "relationship": "equivalent",
              "comment": "R5 \u0060CarePlan\u0060 is assumed equivalent to R4 \u0060CarePlan\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "Claim",
          "display": "A provider issued list of professional services and products which have been provided, or are to be provided, to a patient which is sent to an insurer for reimbursement.",
          "target": [
            {
              "code": "Claim",
              "display": "Claim, Pre-determination or Pre-authorization.",
              "relationship": "equivalent",
              "comment": "R5 \u0060Claim\u0060 is assumed equivalent to R4 \u0060Claim\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "CommunicationRequest",
          "display": "A request to convey information; e.g. the CDS system proposes that an alert be sent to a responsible provider, the CDS system proposes that the public health agency be notified about a reportable condition.",
          "target": [
            {
              "code": "CommunicationRequest",
              "display": "A request for information to be sent to a receiver.",
              "relationship": "equivalent",
              "comment": "R5 \u0060CommunicationRequest\u0060 is assumed equivalent to R4 \u0060CommunicationRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "CoverageEligibilityRequest",
          "display": "The CoverageEligibilityRequest provides patient and insurance coverage information to an insurer for them to respond, in the form of an CoverageEligibilityResponse, with information regarding whether the stated coverage is valid and in-force and optionally to provide the insurance details of the policy.",
          "noMap": true
        },
        {
          "code": "DeviceRequest",
          "display": "Represents a request a device to be provided to a specific patient. The device may be an implantable device to be subsequently implanted, or an external assistive device, such as a walker, to be delivered and subsequently be used.",
          "target": [
            {
              "code": "DeviceRequest",
              "display": "Medical device request.",
              "relationship": "equivalent",
              "comment": "R5 \u0060DeviceRequest\u0060 is assumed equivalent to R4 \u0060DeviceRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "EnrollmentRequest",
          "display": "This resource provides the insurance enrollment details to the insurer regarding a specified coverage.",
          "target": [
            {
              "code": "EnrollmentRequest",
              "display": "Enrollment request.",
              "relationship": "equivalent",
              "comment": "R5 \u0060EnrollmentRequest\u0060 is assumed equivalent to R4 \u0060EnrollmentRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "ImmunizationRecommendation",
          "display": "A patient\u0027s point-in-time set of recommendations (i.e. forecasting) according to a published schedule with optional supporting justification.",
          "target": [
            {
              "code": "ImmunizationRecommendation",
              "display": "Guidance or advice relating to an immunization.",
              "relationship": "equivalent",
              "comment": "R5 \u0060ImmunizationRecommendation\u0060 is assumed equivalent to R4 \u0060ImmunizationRecommendation\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "MedicationRequest",
          "display": "An order or request for both supply of the medication and the instructions for administration of the medication to a patient. The resource is called \u0022MedicationRequest\u0022 rather than \u0022MedicationPrescription\u0022 or \u0022MedicationOrder\u0022 to generalize the use across inpatient and outpatient settings, including care plans, etc., and to harmonize with workflow patterns.",
          "target": [
            {
              "code": "MedicationRequest",
              "display": "Ordering of medication for patient or group.",
              "relationship": "equivalent",
              "comment": "R5 \u0060MedicationRequest\u0060 is assumed equivalent to R4 \u0060MedicationRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "NutritionOrder",
          "display": "A request to supply a diet, formula feeding (enteral) or oral nutritional supplement to a patient/resident.",
          "target": [
            {
              "code": "NutritionOrder",
              "display": "Diet, formula or nutritional supplement request.",
              "relationship": "equivalent",
              "comment": "R5 \u0060NutritionOrder\u0060 is assumed equivalent to R4 \u0060NutritionOrder\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "RequestOrchestration",
          "display": "A set of related requests that can be used to capture intended activities that have inter-dependencies such as \u0022give this medication after that one\u0022.",
          "noMap": true
        },
        {
          "code": "ServiceRequest",
          "display": "A record of a request for service such as diagnostic investigations, treatments, or operations to be performed.",
          "target": [
            {
              "code": "ServiceRequest",
              "display": "A record of a request for service such as diagnostic investigations, treatments, or operations to be performed.",
              "relationship": "equivalent",
              "comment": "R5 \u0060ServiceRequest\u0060 is assumed equivalent to R4 \u0060ServiceRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "SupplyRequest",
          "display": "A record of a non-patient specific request for a medication, substance, device, certain types of biologically derived product, and nutrition product used in the healthcare setting.",
          "target": [
            {
              "code": "SupplyRequest",
              "display": "Request for a medication, substance or device.",
              "relationship": "equivalent",
              "comment": "R5 \u0060SupplyRequest\u0060 is assumed equivalent to R4 \u0060SupplyRequest\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "Task",
          "display": "A task to be performed.",
          "target": [
            {
              "code": "Task",
              "display": "A task to be performed.",
              "relationship": "equivalent",
              "comment": "R5 \u0060Task\u0060 is assumed equivalent to R4 \u0060Task\u0060 (no map, but codes match)"
            }
          ]
        },
        {
          "code": "Transport",
          "display": "Record of transport.",
          "noMap": true
        },
        {
          "code": "VisionPrescription",
          "display": "An authorization for the provision of glasses and/or contact lenses to a patient.",
          "target": [
            {
              "code": "VisionPrescription",
              "display": "Prescription for vision correction products for a patient.",
              "relationship": "equivalent",
              "comment": "R5 \u0060VisionPrescription\u0060 is assumed equivalent to R4 \u0060VisionPrescription\u0060 (no map, but codes match)"
            }
          ]
        }
      ]
    }
  ]
}